#+TITLE: environment-exporter

Exports a JSON list of processes and env vars that are listening on ports at :10093/listening

* Deployment example
Note that when running in Kubernetes, the field =shareProcessNamespace= in =v1.Pod.Spec= must be set to =true=.

#+begin_src yaml :tangle ../../environment-exporter-example.yaml
apiVersion: apps/v1
kind: StatefulSet
metadata:
  name: environment-dev
  namespace: default
spec:
  serviceName: environment-dev
  replicas: 1
  selector:
    matchLabels:
      app: environment-dev
  template:
    metadata:
      labels:
        app: environment-dev
    spec:
      shareProcessNamespace: true
      containers:
        - name: environment
          image: registry.gitlab.com/sharingio/environment:latest
          imagePullPolicy: IfNotPresent
          volumeMounts:
            - name: home-ii
              mountPath: /home/ii
            - name: podlabels
              mountPath: /etc/podlabels
          command:
            - sleep
            - +Inf
        - name: environment-exporter
          image: registry.gitlab.com/sharingio/environment/exporter:latest
          imagePullPolicy: IfNotPresent
          env:
            - name: POD_NAME
              valueFrom:
                fieldRef:
                  fieldPath: metadata.name
          ports:
            - containerPort: 10093
          volumeMounts:
            - name: podlabels
              mountPath: /etc/podlabels
      volumes:
      - name: home-ii
        hostPath:
          path: /home/ii
      - name: podlabels
        downwardAPI:
          items:
            - path: "labels"
              fieldRef:
                fieldPath: metadata.labels
#+end_src

Apply the manifest
#+begin_src shell :dir ../..
kubectl apply -f ./example.yaml
#+end_src

#+RESULTS:
#+begin_example
statefulset.apps/environment-dev created
#+end_example

